## CMPINF 2110 Spring 2022 - Week 04

### Compare Python Pandas and MySQL syntax

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import seaborn as sns

In [2]:
locations = pd.read_csv('../data/location_info_table.csv')

In [3]:
locations

,location_id,location,location_name,street_address,city,state,zipcode
0,1,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123
1,2,N,Noodles & Company,3805 Forbes Ave,Pittsburgh,PA,15123
2,3,P,Panera Bread,3800 Forbes Ave,Pittsburgh,PA,15123

Selecting 1 column in Pandas.

In [4]:
locations[['location_id']]

   location_id
0            1
1            2
2            3

In [5]:
locations.loc[:, ['location_id']]

   location_id
0            1
1            2
2            3

In [6]:
locations.loc[:, ['location_id', 'location']]

   location_id location
0            1        D
1            2        N
2            3        P

In [8]:
locations[['location_id', 'location']]

   location_id location
0            1        D
1            2        N
2            3        P

Select rows based on a condition.

In [9]:
locations.loc[ locations.location == 'D', :]

,location_id,location,location_name,street_address,city,state,zipcode
0,1,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123

In [10]:
locations.loc[ locations.location == 'D', ['location_id', 'location', 'location_name']]

   location_id location  location_name
0            1        D  Dunkin Donuts

To apply an OR condition we must separate each condition with the operator.

In [12]:
locations.loc[(locations.location == 'D') | (locations.location == 'P'), ['location_id', 'location', 'location_name']]

   location_id location  location_name
0            1        D  Dunkin Donuts
2            3        P   Panera Bread

The OR operator can be simplified with the `.isin()` method.

In [13]:
locations.loc[ locations.location.isin(['D', 'P']), :]

,location_id,location,location_name,street_address,city,state,zipcode
0,1,D,Dunkin Donuts,3907 Forbes Ave,Pittsburgh,PA,15123
2,3,P,Panera Bread,3800 Forbes Ave,Pittsburgh,PA,15123

NOT selecting requires the `~` operator.

In [14]:
locations.loc[ ~locations.location.isin(['D','P']), :]

,location_id,location,location_name,street_address,city,state,zipcode
1,2,N,Noodles & Company,3805 Forbes Ave,Pittsburgh,PA,15123

In [15]:
shoes = pd.read_csv('../data/shoe_info_table.csv')

In [16]:
shoes

   shoe_id shoe shoe_color
0        1    B      Black
1        2    O      Other
2        3    R        Red
3        4    W      White

In [17]:
shoes_per_day = pd.read_csv('../data/shoe_per_day_table.csv')

In [18]:
shoes_per_day.head()

   id  day  location_id  shoe_id  value
0   1    1            2        4     12
1   2    2            2        4      5
2   3    3            2        4      9
3   4    4            2        4      4
4   5    1            2        1      5